--- a/README.md
+++ b/README.md
@@ -1,95 +1,51 @@
-
-### 1.2. Protocol Flow
-
-```
-     +--------+                               +---------------+
-     |        |--(A)- Authorization Request ->|   Resource    |
-     |        |                               |     Owner     |
-     |        |<-(B)-- Authorization Grant ---|               |
-     |        |                               +---------------+
-     |        |
-     |        |                               +---------------+
-     |        |--(C)-- Authorization Grant -->| Authorization |
-     | Client |                               |     Server    |
-     |        |<-(D)----- Access Token -------|               |
-     |        |                               +---------------+
-     |        |
-     |        |                               +---------------+
-     |        |--(E)----- Access Token ------>|    Resource   |
-     |        |                               |     Server    |
-     |        |<-(F)--- Protected Resource ---|               |
-     +--------+                               +---------------+
+```mermaid
+sequenceDiagram
+    autonumber
+    Client ->> Resource Owner: Authorization Request
+    activate Resource Owner
+    Resource Owner -->> Client: Authorization Grant
+    deactivate Resource Owner
+    
+    Client ->> Authorization Server: Authorization Grant
+    activate Authorization Server
+    Authorization Server -->> Client: Access Token
+    deactivate Authorization Server
+    
+    Client ->> Resource Server: Access Token
+    activate Resource Server
+    Resource Server -->> Client: Protected Resource
+    deactivate Resource Server
 ```
 
-The abstract OAuth 2.0 flow illustrated in Figure 1 describes the
-interaction between the four roles and includes the following steps:
